
## :white_check_mark: Apply Succeeded (dev)

[CI link](https://github.com/a-company-jp/digi-baton/actions/runs/13712366662)



<pre><code>Apply complete! Resources: 1 added, 0 changed, 4 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
azurerm_resource_group.state-demo-secure: Refreshing state... [id=/subscriptions/079243f8-647d-4602-908a-7f755b3dfbcf/resourceGroups/state-demo]
azurerm_resource_group.digi_baton: Refreshing state... [id=/subscriptions/079243f8-647d-4602-908a-7f755b3dfbcf/resourceGroups/digi-baton]
azurerm_container_registry.crypto: Refreshing state... [id=/subscriptions/079243f8-647d-4602-908a-7f755b3dfbcf/resourceGroups/digi-baton/providers/Microsoft.ContainerRegistry/registries/DigiBatonCryptoDev]
azurerm_container_registry.frontend: Refreshing state... [id=/subscriptions/079243f8-647d-4602-908a-7f755b3dfbcf/resourceGroups/digi-baton/providers/Microsoft.ContainerRegistry/registries/DigiBatonFrontendDev]
azurerm_container_registry.backend: Refreshing state... [id=/subscriptions/079243f8-647d-4602-908a-7f755b3dfbcf/resourceGroups/digi-baton/providers/Microsoft.ContainerRegistry/registries/DigiBatonBackendDev]
azurerm_container_registry.external: Refreshing state... [id=/subscriptions/079243f8-647d-4602-908a-7f755b3dfbcf/resourceGroups/digi-baton/providers/Microsoft.ContainerRegistry/registries/DigiBatonExternalDev]
azurerm_storage_account.main: Refreshing state... [id=/subscriptions/079243f8-647d-4602-908a-7f755b3dfbcf/resourceGroups/digi-baton/providers/Microsoft.Storage/storageAccounts/digibatonmainstorageacct]
azurerm_storage_container.public_container: Refreshing state... [id=https://digibatonmainstorageacct.blob.core.windows.net/digibatonpublic]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_container_registry.backend will be destroyed
  # (because azurerm_container_registry.backend is not in configuration)
  - resource "azurerm_container_registry" "backend" {
      - admin_enabled                 = false -> null
      - anonymous_pull_enabled        = false -> null
      - data_endpoint_enabled         = false -> null
      - encryption                    = [
          - {
              - enabled            = false
                # (2 unchanged attributes hidden)
            },
        ] -> null
      - export_policy_enabled         = true -> null
      - id                            = "/subscriptions/079243f8-647d-4602-908a-7f755b3dfbcf/resourceGroups/digi-baton/providers/Microsoft.ContainerRegistry/registries/DigiBatonBackendDev" -> null
      - location                      = "japaneast" -> null
      - login_server                  = "digibatonbackenddev.azurecr.io" -> null
      - name                          = "DigiBatonBackendDev" -> null
      - network_rule_bypass_option    = "AzureServices" -> null
      - network_rule_set              = [] -> null
      - public_network_access_enabled = true -> null
      - quarantine_policy_enabled     = false -> null
      - resource_group_name           = "digi-baton" -> null
      - retention_policy              = [
          - {
              - days    = 7
              - enabled = false
            },
        ] -> null
      - sku                           = "Basic" -> null
      - tags                          = {} -> null
      - trust_policy                  = [
          - {
              - enabled = false
            },
        ] -> null
      - zone_redundancy_enabled       = false -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_container_registry.crypto will be destroyed
  # (because azurerm_container_registry.crypto is not in configuration)
  - resource "azurerm_container_registry" "crypto" {
      - admin_enabled                 = false -> null
      - anonymous_pull_enabled        = false -> null
      - data_endpoint_enabled         = false -> null
      - encryption                    = [
          - {
              - enabled            = false
                # (2 unchanged attributes hidden)
            },
        ] -> null
      - export_policy_enabled         = true -> null
      - id                            = "/subscriptions/079243f8-647d-4602-908a-7f755b3dfbcf/resourceGroups/digi-baton/providers/Microsoft.ContainerRegistry/registries/DigiBatonCryptoDev" -> null
      - location                      = "japaneast" -> null
      - login_server                  = "digibatoncryptodev.azurecr.io" -> null
      - name                          = "DigiBatonCryptoDev" -> null
      - network_rule_bypass_option    = "AzureServices" -> null
      - network_rule_set              = [] -> null
      - public_network_access_enabled = true -> null
      - quarantine_policy_enabled     = false -> null
      - resource_group_name           = "digi-baton" -> null
      - retention_policy              = [
          - {
              - days    = 7
              - enabled = false
            },
        ] -> null
      - sku                           = "Basic" -> null
      - tags                          = {} -> null
      - trust_policy                  = [
          - {
              - enabled = false
            },
        ] -> null
      - zone_redundancy_enabled       = false -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_container_registry.external will be destroyed
  # (because azurerm_container_registry.external is not in configuration)
  - resource "azurerm_container_registry" "external" {
      - admin_enabled                 = false -> null
      - anonymous_pull_enabled        = false -> null
      - data_endpoint_enabled         = false -> null
      - encryption                    = [
          - {
              - enabled            = false
                # (2 unchanged attributes hidden)
            },
        ] -> null
      - export_policy_enabled         = true -> null
      - id                            = "/subscriptions/079243f8-647d-4602-908a-7f755b3dfbcf/resourceGroups/digi-baton/providers/Microsoft.ContainerRegistry/registries/DigiBatonExternalDev" -> null
      - location                      = "japaneast" -> null
      - login_server                  = "digibatonexternaldev.azurecr.io" -> null
      - name                          = "DigiBatonExternalDev" -> null
      - network_rule_bypass_option    = "AzureServices" -> null
      - network_rule_set              = [] -> null
      - public_network_access_enabled = true -> null
      - quarantine_policy_enabled     = false -> null
      - resource_group_name           = "digi-baton" -> null
      - retention_policy              = [
          - {
              - days    = 7
              - enabled = false
            },
        ] -> null
      - sku                           = "Basic" -> null
      - tags                          = {} -> null
      - trust_policy                  = [
          - {
              - enabled = false
            },
        ] -> null
      - zone_redundancy_enabled       = false -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_container_registry.frontend will be destroyed
  # (because azurerm_container_registry.frontend is not in configuration)
  - resource "azurerm_container_registry" "frontend" {
      - admin_enabled                 = false -> null
      - anonymous_pull_enabled        = false -> null
      - data_endpoint_enabled         = false -> null
      - encryption                    = [
          - {
              - enabled            = false
                # (2 unchanged attributes hidden)
            },
        ] -> null
      - export_policy_enabled         = true -> null
      - id                            = "/subscriptions/079243f8-647d-4602-908a-7f755b3dfbcf/resourceGroups/digi-baton/providers/Microsoft.ContainerRegistry/registries/DigiBatonFrontendDev" -> null
      - location                      = "japaneast" -> null
      - login_server                  = "digibatonfrontenddev.azurecr.io" -> null
      - name                          = "DigiBatonFrontendDev" -> null
      - network_rule_bypass_option    = "AzureServices" -> null
      - network_rule_set              = [] -> null
      - public_network_access_enabled = true -> null
      - quarantine_policy_enabled     = false -> null
      - resource_group_name           = "digi-baton" -> null
      - retention_policy              = [
          - {
              - days    = 7
              - enabled = false
            },
        ] -> null
      - sku                           = "Basic" -> null
      - tags                          = {} -> null
      - trust_policy                  = [
          - {
              - enabled = false
            },
        ] -> null
      - zone_redundancy_enabled       = false -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_container_registry.main will be created
  + resource "azurerm_container_registry" "main" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "japaneast"
      + login_server                  = (known after apply)
      + name                          = "DigiBaton"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "digi-baton"
      + retention_policy              = (known after apply)
      + sku                           = "Basic"
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false
    }

Plan: 1 to add, 0 to change, 4 to destroy.
azurerm_container_registry.external: Destroying... [id=/subscriptions/079243f8-647d-4602-908a-7f755b3dfbcf/resourceGroups/digi-baton/providers/Microsoft.ContainerRegistry/registries/DigiBatonExternalDev]
azurerm_container_registry.crypto: Destroying... [id=/subscriptions/079243f8-647d-4602-908a-7f755b3dfbcf/resourceGroups/digi-baton/providers/Microsoft.ContainerRegistry/registries/DigiBatonCryptoDev]
azurerm_container_registry.frontend: Destroying... [id=/subscriptions/079243f8-647d-4602-908a-7f755b3dfbcf/resourceGroups/digi-baton/providers/Microsoft.ContainerRegistry/registries/DigiBatonFrontendDev]
azurerm_container_registry.backend: Destroying... [id=/subscriptions/079243f8-647d-4602-908a-7f755b3dfbcf/resourceGroups/digi-baton/providers/Microsoft.ContainerRegistry/registries/DigiBatonBackendDev]
azurerm_container_registry.main: Creating...
azurerm_container_registry.backend: Still destroying... [id=/subscriptions/079243f8-647d-4602-908a-...egistry/registries/DigiBatonBackendDev, 10s elapsed]
azurerm_container_registry.frontend: Still destroying... [id=/subscriptions/079243f8-647d-4602-908a-...gistry/registries/DigiBatonFrontendDev, 10s elapsed]
azurerm_container_registry.crypto: Still destroying... [id=/subscriptions/079243f8-647d-4602-908a-...Registry/registries/DigiBatonCryptoDev, 10s elapsed]
azurerm_container_registry.external: Still destroying... [id=/subscriptions/079243f8-647d-4602-908a-...gistry/registries/DigiBatonExternalDev, 10s elapsed]
azurerm_container_registry.main: Still creating... [10s elapsed]
azurerm_container_registry.external: Still destroying... [id=/subscriptions/079243f8-647d-4602-908a-...gistry/registries/DigiBatonExternalDev, 20s elapsed]
azurerm_container_registry.main: Still creating... [20s elapsed]
azurerm_container_registry.backend: Still destroying... [id=/subscriptions/079243f8-647d-4602-908a-...egistry/registries/DigiBatonBackendDev, 20s elapsed]
azurerm_container_registry.crypto: Still destroying... [id=/subscriptions/079243f8-647d-4602-908a-...Registry/registries/DigiBatonCryptoDev, 20s elapsed]
azurerm_container_registry.frontend: Still destroying... [id=/subscriptions/079243f8-647d-4602-908a-...gistry/registries/DigiBatonFrontendDev, 20s elapsed]
azurerm_container_registry.frontend: Destruction complete after 22s
azurerm_container_registry.crypto: Destruction complete after 22s
azurerm_container_registry.external: Destruction complete after 22s
azurerm_container_registry.backend: Destruction complete after 22s
azurerm_container_registry.main: Creation complete after 27s [id=/subscriptions/079243f8-647d-4602-908a-7f755b3dfbcf/resourceGroups/digi-baton/providers/Microsoft.ContainerRegistry/registries/DigiBaton]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 1 added, 0 changed, 4 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"run-terraform-apply","PRNumber":34,"Program":"tfcmt","SHA1":"ff61c63c6af7ea898395963c086ba68d3f310962","Target":"dev","Vars":{},"WorkflowName":"[Infra] Run Terragrunt Apply on main branch push"} -->